app/controllers/appsidies_controller.rb

  def index
    @appsidies = Appsidy.all
---
SELECT "appsidies".* FROM "appsidies"

  def show
    @appsidy = Appsidy.find(params[:id])
---
SELECT  "appsidies".* FROM "appsidies"  WHERE "appsidies"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @appsidy = Appsidy.new(appsidy_params)
    if @appsidy.save
---
INSERT INTO "appsidies" ("appsidy_description", "appsidy_name", "appsidy_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)