app/controllers/apps_controller.rb

SELECT "apps".* FROM "apps"
---
  def index
     @apps = App.all

SELECT  "apps".* FROM "apps"  WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @app = App.find(params[:id])

INSERT INTO "apps" ("app_name", "banner_url", "created_at", "description", "download_link", "icon_url", "updated_at", "user_count") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
   def create
     @app = App.new(app_params)
     if @app.save

SELECT  "apps".* FROM "apps"  WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @app = App.find(params[:id])

SELECT  "apps".* FROM "apps"  WHERE "apps"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "apps" SET "download_link" = ?, "updated_at" = ? WHERE "apps"."id" = 3  [["download_link", "https://github.com/ArcherSys/PDFLint/downloada"], ["updated_at", "2015-04-25 20:15:40.515255"]]
---
   def update
     @app = App.find(params[:id])
     if
    @app.update_attributes(app_params)

SELECT  "apps".* FROM "apps"  WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete
      @app = App.find(params[:id])