app/controllers/categories_controller.rb

  def index
    @categories = Categories.all
---
SELECT "categories".* FROM "categories"

  def show
    @category = Categories.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]