app/controllers/platform_controller.rb

  def index
    @platforms = Platform.all
---
SELECT "platforms".* FROM "platforms"